{"pageProps":{"post":{"title":"Progress on my Literature Review for HUT","excerpt":"My Honors Undergraduate Thesis proposal is going well, and here I discuss the literature review I did for this proposal.","content":{"raw":{"children":[{"type":"paragraph","children":[{"text":"Hello everyone! Today, I will talk about my Honors Undergraduate Thesis proposal. It is one of my projects that I am working on this summer and one that I am very excited about. Writing an undergraduate thesis is a lot of work; putting in the effort always feels better when it is about a topic that's enjoyed sincerely."}]},{"type":"paragraph","children":[{"text":"First, I want to discuss the literature review, one of the primary focuses of writing a research proposal. To propose a new idea about a rapidly evolving area, you need to understand what is currently happening in research in that area. I have read many new papers about natural language processing, contrastive learning, and sentiment analysis, as well as many older papers about fundamental ideas in these areas. Having a solid idea of these areas and proposing something helpful and practical is essential."}]},{"type":"paragraph","children":[{"text":"Reading these papers is a change of pace compared to other things I have read for academics. In one of my classes at UCF, Professional Technical Writing, our final project was to write a research proposal. It was informal since it was mainly about the writing process and not the researching process, but it has become a loose guideline of what to do. I have also been using the resources provided by the Burnett Honors College at UCF since this program has given me the honor of becoming an honors student. "}]},{"type":"paragraph","children":[{"text":"Now, I would like to discuss the specifics of this research proposal. Since I have worked as a research assistant in a project that used contrastive learning to predict sentiment for the market, I am using those skills I learned for my idea for this thesis proposal. The papers I have read so far have a similar issue; they need help detecting true negatives regarding sentiment. I will use contrastive learning and other ways of grouping data to recognize negative sentiment. Doing this will be a significant contribution because the most prominent issue with sentiment analysis on user-generated content is correctly detecting true negative results. By improving existing algorithms to detect negative sentiment more accurately, I can enhance sentiment analysis, an essential field in machine learning."}]},{"type":"paragraph","children":[{"text":"While I don't plan to make my proposal public, I will update you on how this project goes on my blog. Once my thesis is out, it will be on the projects page. I hope you all enjoyed reading and learning more about my academic goals. Thanks!"}]}]}},"author":{"name":"Liam Kilkenny","biography":null,"id":"clwtmqok20nlv07lnay4kvy09","picture":{"url":"https://us-east-1-shared-usea1-02.graphassets.com/ALbpAw8qKT96yfs4HLEiAz/3jLmcJAIQ8GTMNVwlype"}},"slug":"post-6","date":"2024-07-07","categories":[{"name":"Machine Learning","slug":"ml"}]}},"__N_SSG":true}