{"pageProps":{"finProjects":["<h2 id=\"wavecontactmanager\">Wave Contact Manager</h2>\n<ul>\n<li>January 2024 - February 2024</li>\n</ul>\n<p>This project was created as a part of COP 4331, Processes of Object-Oriented Programming, at UCF. It was created in a team of five, where I was the project manager and database manager. It was created using a LAMP stack: Linux server, Apache, MySQL, and PHP.</p>\n<p>This project aimed to make a contact manager where users can register, log in, and then manage contacts by inserting, deleting, modifying, and searching. We made our website have an ocean theme, from which the name \"wave\" comes. This name was also a feature on the website that would allow a user to \"wave\" to a contact by clicking a button that prepared a default emailing template in the user's default mailing app. This project was hosted by DigitalOcean during the Spring 2024 semester.</p>\n<p>As the project manager, I used Trello to ensure the team met the deadlines required for us to succeed. I also held meetings to ensure everyone in the team was adequately coordinating.\nAs the database manager, I used MySQL to set up the database, with different users who logged in and added contacts to their lists. I worked closely with the API team to ensure that their PHP scripts would work with the naming convention used in the database.</p>\n<p><a href=\"https://github.com/kilkennylj/Wave-Contact-Manager\">GitHub Repository</a></p>","<h2 id=\"turntable\">Turntable</h2>\n<ul>\n<li>February 2024 - May 2024</li>\n</ul>\n<p>This project was created as a part of COP 4331, Processes of Object-Oriented Programming, at UCF. It was created in a team of seven, where I was the project manager, database manager, and API developer. It was created using a MERN stack: MongoDB, ExpressJS, ReactJS, and NodeJS.</p>\n<p>The project aimed to use LastFM and Spotify's APIs to allow users to click on albums for collection and rating purposes. This project was available on the web and mobile using Heroku.</p>\n<p>As the project manager, I used Jira to manage the team and ensure we knew when to finish deadlines and what pieces were critical for the project's success. I held weekly meetings where we would ensure everyone on the team was aware of progress and problems.</p>\n<p>As the database manager, I used MongoDB to make the database for this project. This job was much more complex than the previous project because of using the LastFM API and the Spotify API. I had to clean the database to ensure there were no bogus entries, which was often the case since there were issues with LastFM's API.</p>\n<p>As an API developer, I worked with LastFM's API and Spotify's API to make the connection between their APIs and our API seamless. This took a lot of effort, and Spotify was only implemented as a backup for when LastFM's API would fail, which was often. After many debugging trials, this API appropriately worked, and the only issue was that it had more features available than we had time to implement in the final for the class it was made for.</p>\n<p><a href=\"https://github.com/kilkennylj/Turntable\">GitHub Repository</a></p>","<h2 id=\"honorsundergraduatethesis\">Honors Undergraduate Thesis</h2>\n<ul>\n<li>June 2024 - December 2025</li>\n</ul>\n<p>My honors undergraduate thesis is titled, \"Occupancy Prediction in Airbnb Listings Using Deep and Classical Machine Learning Models\".\nThe proposal for this project was completed in August 2024, and the thesis was completed and published in December 2025.</p>\n<p>The inspiration for this thesis came from a study which I came across while being an assistant researcher in my sophomore and junior years in university.\nThis paper used Airbnb data to predict rental prices in a region using multimodal data.\nIt highlighted in it’s future directions section, that using more diverse data and fine-tuning more advanced models could lead to improved results.\nMy thesis did this by fine-tuning 6 different models over regions of differing sparsity and complexity.\nAfter this, the models predicted occupancy which allows for a customer or an owner to know when a desired listing should be available.</p>\n<p><a href=\"https://stars.library.ucf.edu/hut2024/439/\">Link to Thesis</a></p>"],"unfinProjects":["<h2 id=\"securityconcernsinagenticaisystems\">Security Concerns in Agentic AI Systems</h2>\n<ul>\n<li>September 2025 - May 2026</li>\n</ul>\n<p>This project was given to my senior design team by the Georgia Tech Research Institute. The aim of this project is to build an agentic artificial intelligence system and then examine the security concerns of the system so that proper defenses can be created. In this project, we focused on making the repository clean and understandable with concise documentation so that anyone could run the agentic system with any level of defenses applied to the system.</p>\n<p>For our agentic AI system, we created an orchestrator agent and 5 assistant agents which each had at least one tool. We created base versions for the agents and tools so that we could utilize inheritance and keep clarity in our repository. When the system is run, our chatbot DocTalk gives healthcare advice, handles appointments, calculates statistics, and gives information about diagnoses and prescriptions. It performs these actions by utilizing remote code execution, reading a SQL database, making API calls, and scraping websites.</p>\n<p>During the creation of the agentic AI system, I worked as the artificial intelligence team lead for this project. This position required me to create a proper object oriented file structure for our agents, meet regularly so that the work can be properly divided and developed, and brainstorm so the infrastructure pieces work properly with the agents.</p>"]},"__N_SSG":true}