{"pageProps":{"post":{"title":"Start of My Game Development","excerpt":"I talk about one of my for fun side projects, a space game created using Godot and models from Blender.","content":{"raw":{"children":[{"type":"paragraph","children":[{"text":"Hey everyone! Today, I will be talking about the game that I am starting development for this summer. I decided to do this because games were a big part of my childhood, so building one as a side project would be fun. Since game development is not my main focus, the game will take a while to complete, but I plan on being close to done with the modeling and the texturing by the end of the summer and ultimately finished with those two things by the end of the year."}]},{"type":"paragraph","children":[{"text":"First, I want to talk about the modeling process and how great it feels to make progress with it. I am using a blender, and I love it so far. When I completed my first model in Blender, an unmade bed, I felt accomplished and excited about my progress. All of the tools are so interesting, and I like how they work together in an intuitive way that doesn’t have me second-guessing how things should work. I am finishing up the dorm room part of my game, which takes place inside a spaceship. "}]},{"type":"paragraph","children":[{"text":"Now, I want to talk specifically about the space idea that I got. I have loved space and everything about it for a long time. The scope of this game is small, so space is just the setting and a way of giving meaning to the game. I have many ideas on how to do space justice in my game with visuals and some tools in my game engine. I am using Godot, which has been recommended to me by many people who are seriously working on game development. I haven’t done much work with it yet since I will work on the models and ideas of the game first. But I look forward to learning it since it does seem like a fun process."}]},{"type":"paragraph","children":[{"text":"That covers how the beginning of this game development is going. I am enjoying the new type of development that goes into game development and modeling with Blender. Right now, the game is still closed source, but to show the work I put in since it is more of a passion project than a money maker, I will make it open source once I feel I should. Thanks for reading!"}]}]}},"author":{"name":"Liam Kilkenny","biography":null,"id":"clwtmqok20nlv07lnay4kvy09","picture":null},"slug":"post-3","publishedAt":"2024-06-17T17:30:14.170384+00:00","categories":[{"name":"Game Development","slug":"gamedev"}]}},"__N_SSG":true}