{"pageProps":{"post":{"title":"New Environment, New Skills","excerpt":"I talk about my work as a research assistant and how this helped me develop new skills.","content":{"raw":{"children":[{"type":"paragraph","children":[{"text":"Hello everyone! This past week, I have done many things I have found challenging, and now I would like to reflect on them. Especially the way complex tasks feel when they aren’t structured as a class, which is what we are used to as students. Becoming able to handle tasks in a way that is different than it was at school is essential for the workforce and being an adult in general."}]},{"type":"paragraph","children":[{"text":"First, I want to talk about the tasks that I found hard and mention how the environmental change slowed my progress. If you aren’t aware, I work as an undergraduate research assistant on a financial research project. The experience is unlike any class I have had, which is great, but also creates problems. A different environment is fun but sometimes stressful because you must ensure you do things correctly. In a classroom, when something is difficult, you go to the teacher and ask them for help, or you review the book/lecture, and then you can solve the problem. In a research environment, difficulties are common, and the solution isn’t neatly sorted, unlike all the other issues you have in one textbook. You need to read papers and ask the right questions to the right people to understand how to make a difference in the field you are researching. This jump between research problems and classroom problems is massive."}]},{"type":"paragraph","children":[{"text":"Many skills are at your fingertips once you jump and can thrive in a research environment. These skills are working well in a team, understanding the core issue of a subject, and learning how to solve problems with the resources you have available. And it’s not just in a research environment; it’s any environment where you try to progress toward a common goal with your team. These skills I am referring to are skills I see in my idols, and I am understanding more of why people always recommend clubs and extracurricular activities in college. "}]},{"type":"paragraph","children":[{"text":"Classes are great for teaching ideas and allowing students to understand topics they are interested in. However, classes aren’t very good at teaching how to do these skills; they usually just have the student solve this question, which generally has a direct answer in the textbook. Finding an answer isn’t as easy as opening one book and searching for the question in the real world. Classes help students immensely in many ways, but the bad habits they put into students are harmful, and researching has helped me realize that there are bad habits I have as a student and that there are things I did not know how to do before this project. But I am glad to say that I am ironing out these problems, and I feel that I am becoming more prepared than ever for life after college. Thanks for reading."}]}]}},"author":{"name":"Liam Kilkenny","biography":null,"id":"clwtmqok20nlv07lnay4kvy09","picture":{"url":"https://media.graphassets.com/3jLmcJAIQ8GTMNVwlype"}},"slug":"post-5","date":"2024-06-30","categories":[{"name":"Extracurricular","slug":"extracurricular"}]}},"__N_SSG":true}